Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide Enumeration
 The values that determine on which side(s) the mark tag text is shown.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TagShowOnSide
Public Enumeration TagShowOnSide
Members
Member name | Value | Description
ShowOnBothSides | 1 |  Show on both sides.
ShowOnLeftSideOnly | 2 |  Show only on the left side.
ShowOnRightSideOnly | 3 |  Show only on the right side.
See Also
Reference
Tekla.Structures.Drawing Namespace